wosayttn/M55M1BSP/Library/StdDriver/src/fmc.c
    g_FMC_i32ErrCode = FMC_OK;

    if (((u32Addr % 8) != 0) ||
            ((u32Addr < FMC_APROM_BASE) || ((u32Addr + u32Len) > FMC_APROM_END)) &&
            ((u32Addr < FMC_LDROM_BASE) || ((u32Addr + u32Len) > FMC_LDROM_END))
       )
    {
        g_FMC_i32ErrCode = -2;
        return -2;
    }

    u32Len = u32Len - (u32Len % 8);         /* u32Len must be multiple of 8. */
    idx = 0;

    while (u32Len >= 8)
    {
        FMC->ISPADDR = u32Addr;
        FMC->MPDAT0  = pu32Buf[idx++];
        FMC->MPDAT1  = pu32Buf[idx++];
        FMC->MPDAT2  = pu32Buf[idx++];
        FMC->MPDAT3  = pu32Buf[idx++];
        FMC->ISPCMD  = FMC_ISPCMD_PROGRAM_MUL;
        FMC->ISPTRG  = FMC_ISPTRG_ISPGO_Msk;

        for (i = 16; i < FMC_MULTI_WORD_PROG_LEN;)
        {
            i32TimeOutCnt = FMC_TIMEOUT_WRITE;

            while (FMC->MPSTS & (FMC_MPSTS_D0_Msk | FMC_MPSTS_D1_Msk))
            {
                if (i32TimeOutCnt-- <= 0)
                {
                    g_FMC_i32ErrCode = FMC_ERR_TIMEOUT;
                    return FMC_ERR_TIMEOUT;
                }
            }

            retval += 8;
            u32Len -= 8;

            if (u32Len < 8)
            {
                return retval;
            }

            if (!(FMC->MPSTS & FMC_MPSTS_MPBUSY_Msk))
            {
                /* printf("    [WARNING] busy cleared after D0D1 cleared!\n"); */
                i += 8;
                break;
            }

            FMC->MPDAT0 = pu32Buf[idx++];
            FMC->MPDAT1 = pu32Buf[idx++];

            if (i == FMC_MULTI_WORD_PROG_LEN / 4)
                break;           // done

            i32TimeOutCnt = FMC_TIMEOUT_WRITE;

            while (FMC->MPSTS & (FMC_MPSTS_D2_Msk | FMC_MPSTS_D3_Msk))
            {
                if (i32TimeOutCnt-- <= 0)
                {
                    g_FMC_i32ErrCode = FMC_ERR_TIMEOUT;
                    return FMC_ERR_TIMEOUT;
                }
            }

            retval += 8;
            u32Len -= 8;

            if (u32Len < 8)
            {
                return retval;
            }

            if (!(FMC->MPSTS & FMC_MPSTS_MPBUSY_Msk))
            {
                /* printf("    [WARNING] busy cleared after D2D3 cleared!\n"); */
                i += 8;
                break;
            }

            FMC->MPDAT2 = pu32Buf[idx++];
            FMC->MPDAT3 = pu32Buf[idx++];
        }

        if (i != FMC_MULTI_WORD_PROG_LEN)
        {
            /* printf("    [WARNING] Multi-word program interrupted at 0x%x !!\n", i); */
            return retval;
        }

        i32TimeOutCnt = FMC_TIMEOUT_WRITE;

        while (FMC->MPSTS & FMC_MPSTS_MPBUSY_Msk)
        {
            if (i32TimeOutCnt-- <= 0)
            {
                g_FMC_i32ErrCode = FMC_ERR_TIMEOUT;
                return FMC_ERR_TIMEOUT;
            }
        }

        u32Addr += FMC_MULTI_WORD_PROG_LEN;
    }

    return retval;
}

/**
  * @brief Execute FMC_ISPCMD_PAGE_ERASE command to erase a flash page. The page size is 4096 bytes.
  * @param[in]  u32PageAddr Address of the flash page to be erased.
  *             It must be a 4096 bytes aligned address.
  * @return ISP page erase success or not.
  * @retval   FMC_OK                Success
  * @retval   FMC_ERR_ERASE_FAILED  Erase failed
  *
  * @note     Global error code g_FMC_i32ErrCode
  *           FMC_ERR_TIMEOUT       Erase time-out
  *           FMC_ERR_ERASE_FAILED  Erase failed
  */
int32_t FMC_Erase(uint32_t u32PageAddr)
{
    int32_t i32RetCode = FMC_OK;
    int32_t i32TimeOutCnt;

    g_FMC_i32ErrCode = FMC_OK;

    FMC->ISPCMD  = FMC_ISPCMD_PAGE_ERASE;
    FMC->ISPADDR = u32PageAddr;
    FMC->ISPTRG  = FMC_ISPTRG_ISPGO_Msk;

    i32TimeOutCnt = FMC_TIMEOUT_ERASE;

    while (FMC->ISPTRG & FMC_ISPTRG_ISPGO_Msk)
    {
        if (i32TimeOutCnt-- <= 0)
        {
            g_FMC_i32ErrCode = FMC_ERR_TIMEOUT;
            i32RetCode = FMC_ERR_TIMEOUT;
            break;
        }
    }

    if (FMC->ISPCTL & FMC_ISPCTL_ISPFF_Msk)
    {
        FMC->ISPCTL |= FMC_ISPCTL_ISPFF_Msk;
        g_FMC_i32ErrCode = FMC_ERR_ERASE_FAILED;
        i32RetCode = FMC_ERR_ERASE_FAILED;
    }

    return i32RetCode;
}

/**
  * @brief Execute ISP commands to erase then write User Configuration.
  * @param[in] u32ConfigAddr   Address of config word
  * @param[in] u32ConfigVal    New config value to be written.
  * @return Success or not.
  * @retval   FMC_OK   Success
  * @retval   -1  Erase/program/read/verify failed
  *
  * @note     Global error code g_FMC_i32ErrCode
  *           < 0  Errors caused by erase/program/read failed or time-out
  */
int32_t FMC_WriteConfig(uint32_t u32ConfigAddr, uint32_t u32ConfigVal)
{
    FMC_ENABLE_CFG_UPDATE();

    if (FMC_EraseConfig(u32ConfigAddr) != 0)
    {
        return -1;
    }

    if (FMC_Read(u32ConfigAddr) != 0xFFFFFFFF)
    {
        FMC_DISABLE_CFG_UPDATE();
        return -1;
    }

    if (g_FMC_i32ErrCode != FMC_OK)
    {
        FMC_DISABLE_CFG_UPDATE();
        return -1;
    }

    if (FMC_Write(u32ConfigAddr, u32ConfigVal) != FMC_OK)
    {
        FMC_DISABLE_CFG_UPDATE();
        return -1;
    }

    if (FMC_Read(u32ConfigAddr) != u32ConfigVal)
    {
        FMC_DISABLE_CFG_UPDATE();
        return -1;
    }

    if (g_FMC_i32ErrCode != FMC_OK)
    {
        FMC_DISABLE_CFG_UPDATE();
        return -1;
    }

    FMC_DISABLE_CFG_UPDATE();
    return FMC_OK;
}

/**
  * @brief      Execute FMC_ISPCMD_CFG_ERASE command to erase a config word.
  * @param[in]  u32ConfigAddr Address of config word to be erased.
  * @return     ISP config erase success or not.
  * @retval     FMC_OK                Success
  * @retval     FMC_ERR_ERASE_FAILED  Erase failed
  *
  * @note       Global error code g_FMC_i32ErrCode
  *             FMC_ERR_TIMEOUT       Erase time-out
  *             FMC_ERR_ERASE_FAILED  Erase failed
  */
int32_t FMC_EraseConfig(uint32_t u32ConfigAddr)
{
    int32_t i32RetCode = FMC_OK;
    int32_t i32TimeOutCnt;

    g_FMC_i32ErrCode = FMC_OK;

