wosayttn/M55M1BSP/Library/StdDriver/src/fmc.c
    g_FMC_i32ErrCode = FMC_OK;

    if (u32XomNum >= XOMR_CNT)
    {
        i32RetCode = FMC_ERR_INVALID_PARAM;
    }

    if (i32RetCode == FMC_OK)
    {
        i32Active = FMC_GetXOMState(u32XomNum);

        if (i32Active)
        {
            switch (u32XomNum)
            {
            case 0u:
                u32Addr = (FMC->XOMR0STS & 0xFFFFFF00u) >> 8u;
                break;

            case 1u:
                u32Addr = (FMC->XOMR1STS & 0xFFFFFF00u) >> 8u;
                break;

            case 2u:
                u32Addr = (FMC->XOMR2STS & 0xFFFFFF00u) >> 8u;
                break;

            case 3u:
                u32Addr = (FMC->XOMR3STS & 0xFFFFFF00u) >> 8u;
                break;

            default:
                /* Should not be here */
                i32RetCode = FMC_ERR_INVALID_PARAM;
                goto lexit;
            }

            FMC->ISPCMD  = FMC_ISPCMD_PAGE_ERASE;
            FMC->ISPADDR = u32Addr;
            FMC->ISPDAT  = 0x55aa03u;
            FMC->ISPTRG  = 0x1u;
#if ISBEN
            __ISB();
#endif
            i32TimeOutCnt = FMC_TIMEOUT_ERASE;

            while (FMC->ISPTRG)
            {
                if (i32TimeOutCnt-- <= 0)
                {
                    i32RetCode = FMC_ERR_TIMEOUT;
                    break;
                }
            }

            /* Check ISPFF flag to know whether erase OK or fail. */
            if (FMC->ISPCTL & FMC_ISPCTL_ISPFF_Msk)
            {
                FMC->ISPCTL |= FMC_ISPCTL_ISPFF_Msk;
                i32RetCode = FMC_ERR_ERASE_FAILED;
            }
        }
        else
        {
            i32RetCode = FMC_ERR_INVALID_PARAM;
        }
    }

lexit:
    g_FMC_i32ErrCode = i32RetCode;
    return i32RetCode;
}

/**
  * @brief Get the current boot source.
  * @return The current boot source.
  * @retval   0  Is boot from APROM.
  * @retval   1  Is boot from LDROM.
  */
int32_t FMC_GetBootSource(void)
{
    uint32_t u32Config0;

    u32Config0 = FMC_Read(FMC_USER_CONFIG_0);

    if ((g_FMC_i32ErrCode != FMC_OK) || FMC_GET_FAIL_FLAG())
    {
        FMC_CLR_FAIL_FLAG();
        return FMC_ERR_READ_FAILED;
    }

    return (((u32Config0 & BIT7) == 0) ? 1 : 0);
}

/**
  * @brief  Read the 64-bits data from the specified OTP.
  * @param[in] u32OtpNum    The OTP number.
  * @param[in] pu32LowWord   Low word of the 64-bits data.
  * @param[in] pu32HighWord  High word of the 64-bits data.
  * @retval   FMC_OK   Success
  * @retval   -1  Read failed.
  * @retval   -2  Invalid OTP number.
  *
  * @note     Global error code g_FMC_i32ErrCode
  *           -1  Read failed or time-out
  *           -2  Invalid OTP number
  */
int32_t FMC_ReadOTP(uint32_t u32OtpNum, uint32_t *pu32LowWord, uint32_t *pu32HighWord)
{
    int32_t i32RetCode = FMC_OK;
    int32_t i32TimeOutCnt;

    g_FMC_i32ErrCode = FMC_OK;

    if (u32OtpNum >= FMC_OTP_ENTRY_CNT)
    {
        g_FMC_i32ErrCode = -2;
        i32RetCode = -2;
    }

    if (i32RetCode == FMC_OK)
    {
        FMC->ISPCMD  = FMC_ISPCMD_READ_64;
        FMC->ISPADDR = FMC_OTP_BASE + u32OtpNum * 8UL ;
        FMC->ISPDAT  = 0x0UL;
        FMC->ISPTRG  = FMC_ISPTRG_ISPGO_Msk;

        i32TimeOutCnt = FMC_TIMEOUT_READ;

        while (FMC->ISPSTS & FMC_ISPSTS_ISPBUSY_Msk)
        {
            if (i32TimeOutCnt-- <= 0)
            {
                g_FMC_i32ErrCode = FMC_ERR_TIMEOUT;
                i32RetCode = FMC_ERR_TIMEOUT;
                break;
            }
        }

        if (FMC->ISPSTS & FMC_ISPSTS_ISPFF_Msk)
        {
            FMC->ISPSTS |= FMC_ISPSTS_ISPFF_Msk;
            g_FMC_i32ErrCode = -1;
            i32RetCode = -1;
        }
        else
        {
            *pu32LowWord = FMC->MPDAT0;
            *pu32HighWord = FMC->MPDAT1;
        }
    }

    return i32RetCode;
}

/**
  * @brief Program a 64-bits data to the specified OTP.
  * @param[in] u32OtpNum    The OTP number.
  * @param[in] u32LowWord   Low word of the 64-bits data.
  * @param[in] u32HighWord  High word of the 64-bits data.
  * @retval   FMC_OK   Success
  * @retval   -1  Program failed.
  * @retval   -2  Invalid OTP number.
  *
  * @note     Global error code g_FMC_i32ErrCode
  *           -1  Program failed or time-out
  *           -2  Invalid OTP number
  */
int32_t FMC_WriteOTP(uint32_t u32OtpNum, uint32_t u32LowWord, uint32_t u32HighWord)
{
    int32_t i32RetCode = FMC_OK;
    int32_t i32TimeOutCnt;

    g_FMC_i32ErrCode = FMC_OK;

    if (u32OtpNum >= FMC_OTP_ENTRY_CNT)
    {
        g_FMC_i32ErrCode = -2;
        i32RetCode = -2;
    }

    if (i32RetCode == FMC_OK)
    {
        FMC->ISPCMD  = FMC_ISPCMD_PROGRAM;
        FMC->ISPADDR = FMC_OTP_BASE + u32OtpNum * 8UL;
        FMC->ISPDAT  = u32LowWord;
        FMC->ISPTRG  = FMC_ISPTRG_ISPGO_Msk;

        i32TimeOutCnt = FMC_TIMEOUT_WRITE;

        while (FMC->ISPTRG & FMC_ISPTRG_ISPGO_Msk)
        {
            if (i32TimeOutCnt-- <= 0)
            {
                g_FMC_i32ErrCode = FMC_ERR_TIMEOUT;
                i32RetCode = FMC_ERR_TIMEOUT;
                break;
            }
        }

        if (FMC->ISPSTS & FMC_ISPSTS_ISPFF_Msk)
        {
            FMC->ISPSTS |= FMC_ISPSTS_ISPFF_Msk;
            g_FMC_i32ErrCode = -1;
            i32RetCode = -1;
        }
    }

    if (i32RetCode == FMC_OK)
    {
        FMC->ISPCMD  = FMC_ISPCMD_PROGRAM;
        FMC->ISPADDR = FMC_OTP_BASE + u32OtpNum * 8UL + 4UL;
        FMC->ISPDAT  = u32HighWord;
        FMC->ISPTRG  = FMC_ISPTRG_ISPGO_Msk;

        i32TimeOutCnt = FMC_TIMEOUT_WRITE;

        while (FMC->ISPTRG & FMC_ISPTRG_ISPGO_Msk)
        {
            if (i32TimeOutCnt-- <= 0)
            {
                g_FMC_i32ErrCode = FMC_ERR_TIMEOUT;
                i32RetCode = FMC_ERR_TIMEOUT;
                break;
            }
        }

        if (FMC->ISPSTS & FMC_ISPSTS_ISPFF_Msk)
        {
            FMC->ISPSTS |= FMC_ISPSTS_ISPFF_Msk;
            g_FMC_i32ErrCode = -1;
            i32RetCode = -1;
        }
    }

    return i32RetCode;
}

/**
  * @brief  Lock the specified OTP.
  * @param[in] u32OtpNum    The OTP number.
  * @retval    FMC_OK  Success
  * @retval   -1  Failed to write OTP lock bits.
  * @retval   -2  Invalid OTP number.
  *
  * @note     Global error code g_FMC_i32ErrCode
  *           -1  Failed to write OTP lock bits or write time-out
  *           -2  Invalid OTP number
  */
int32_t FMC_LockOTP(uint32_t u32OtpNum)
{
    int32_t i32RetCode = FMC_OK;
    int32_t i32TimeOutCnt;

