wosayttn/M55M1BSP/Library/StdDriver/src/fmc.c
    g_FMC_i32ErrCode = FMC_OK;

    if (u32OtpNum >= FMC_OTP_ENTRY_CNT)
    {
        g_FMC_i32ErrCode = -2;
        i32RetCode = -2;
    }

    if (i32RetCode == FMC_OK)
    {
        FMC->ISPCMD  = FMC_ISPCMD_PROGRAM;
        FMC->ISPADDR = FMC_OTP_BASE + 0x800UL + u32OtpNum * 4UL;
        FMC->ISPDAT  = 0UL;
        FMC->ISPTRG  = FMC_ISPTRG_ISPGO_Msk;

        i32TimeOutCnt = FMC_TIMEOUT_WRITE;

        while (FMC->ISPTRG & FMC_ISPTRG_ISPGO_Msk)
        {
            if (i32TimeOutCnt-- <= 0)
            {
                g_FMC_i32ErrCode = FMC_ERR_TIMEOUT;
                i32RetCode = FMC_ERR_TIMEOUT;
                break;
            }
        }

        if (FMC->ISPSTS & FMC_ISPSTS_ISPFF_Msk)
        {
            FMC->ISPSTS |= FMC_ISPSTS_ISPFF_Msk;
            g_FMC_i32ErrCode = -1;
            i32RetCode = -1;
        }
    }

    return i32RetCode;
}

/**
  * @brief  Check the OTP is locked or not.
  * @param[in] u32OtpNum    The OTP number.
  * @retval   1   OTP is locked.
  * @retval   0   OTP is not locked.
  * @retval   -1  Failed to read OTP lock bits.
  * @retval   -2  Invalid OTP number.
  *
  * @note     Global error code g_FMC_i32ErrCode
  *           -1  Failed to read OTP lock bits or read time-out
  *           -2  Invalid OTP number
  */
int32_t FMC_IsOTPLocked(uint32_t u32OtpNum)
{
    int32_t i32RetCode = FMC_OK;
    int32_t i32TimeOutCnt;

    g_FMC_i32ErrCode = FMC_OK;

    if (u32OtpNum >= FMC_OTP_ENTRY_CNT)
    {
        g_FMC_i32ErrCode = -2;
        i32RetCode = -2;
    }

    if (i32RetCode == FMC_OK)
    {
        FMC->ISPCMD  = FMC_ISPCMD_READ;
        FMC->ISPADDR = FMC_OTP_BASE + 0x800UL + u32OtpNum * 4UL;
        FMC->ISPTRG  = FMC_ISPTRG_ISPGO_Msk;

        i32TimeOutCnt = FMC_TIMEOUT_READ;

        while (FMC->ISPTRG & FMC_ISPTRG_ISPGO_Msk)
        {
            if (i32TimeOutCnt-- <= 0)
            {
                g_FMC_i32ErrCode = -1;
                i32RetCode = FMC_ERR_TIMEOUT;
                break;
            }
        }

        if (FMC->ISPSTS & FMC_ISPSTS_ISPFF_Msk)
        {
            FMC->ISPSTS |= FMC_ISPSTS_ISPFF_Msk;
            g_FMC_i32ErrCode = -1;
            i32RetCode = -1;
        }
        else
        {
            if (FMC->ISPDAT != 0xFFFFFFFFUL)
            {
                g_FMC_i32ErrCode = -1;
                i32RetCode = 1;   /* Lock work was progrmmed. OTP was locked. */
            }
        }
    }

    return i32RetCode;
}

/**
  * @brief     Config Secure Conceal Region
  * @param[in] u32Base          Secure conceal base address. It must be page alignment and cannot be first page of APROM
  * @param[in] u32PageCnt       Secure conceal page count.
  * @param[in] bActiveEnable    TRUE:  Allowed to active secure conceal region
  *                             FALSE: Secure conceal region cannot be activated.
  *
  * @retval   FMC_OK                     Success
  * @retval   FMC_ERR_TIMEOUT            Operation timeout
  * @retval   FMC_ERR_SC_INVALID_BASE    Invalid secure concel base address.
  * @retval   FMC_ERR_SC_INVALID_PAGECNT Invalid secure concel page count.
  * @retval   FMC_ERR_SC_ENABLED         Secure concel is enabled and cannot be modified.
  *
  * @details  Program secure conceal base address, page count and active enable.
  */
int32_t  FMC_ConfigSecureConceal(uint32_t u32Base, uint32_t u32PageCnt, uint32_t bActiveEnable)
{
    int32_t  i32RetCode = FMC_OK;
    uint32_t u32Config6;

    if ((u32Base == FMC_APROM_BASE) || (u32Base % FMC_FLASH_PAGE_SIZE) != 0)
        return FMC_ERR_SC_INVALID_BASE;

    if (u32PageCnt == 0)
        return FMC_ERR_SC_INVALID_PAGECNT;

    u32Config6 = FMC_Read(FMC_USER_CONFIG_6);

    if (u32Config6 != 0xFFFFFFFF)
        return FMC_ERR_SC_ENABLED;

    if ((FMC_Read(FMC_USER_CONFIG_4) == u32Base) && (FMC_Read(FMC_USER_CONFIG_5) == u32PageCnt))
        return FMC_OK;

    if ((i32RetCode = FMC_EraseConfig(FMC_USER_CONFIG_4)) != FMC_OK)
        return i32RetCode;

    if ((i32RetCode = FMC_EraseConfig(FMC_USER_CONFIG_5)) != FMC_OK)
        return i32RetCode;

    if ((i32RetCode = FMC_EraseConfig(FMC_USER_CONFIG_6)) != FMC_OK)
        return i32RetCode;

    if ((i32RetCode = FMC_Write(FMC_USER_CONFIG_4, u32Base)) != FMC_OK)
        return i32RetCode;

    if ((i32RetCode = FMC_Write(FMC_USER_CONFIG_5, u32PageCnt)) != FMC_OK)
        return i32RetCode;

    if (bActiveEnable)
    {
        if ((i32RetCode = FMC_Write(FMC_USER_CONFIG_6, bActiveEnable)) != FMC_OK)
            return i32RetCode;
    }

    return i32RetCode;
}

/**
  * @brief Run CRC32 checksum calculation and get result.
  * @param[in] u32Addr   Starting flash address. It must be a page aligned address.
  * @param[in] u32count  Byte count of flash to be calculated. It must be multiple of 512 bytes.
  * @return Success or not.
  * @retval   0xFFFFFFFF  Invalid parameter or command failed.
  * @retval   Others      CRC32 value
  *
  * @note     Global error code g_FMC_i32ErrCode
  *           FMC_ERR_TIMEOUT        Run/Read check sum time-out failed
  *           FMC_ERR_INVALID_PARAM  u32Addr or u32count must be aligned with 8 KB page alignment
  */
#if 0   // TESTCHIP_ONLY not support
uint32_t  FMC_GetChkSum(uint32_t u32Addr, uint32_t u32count)
{
    int32_t i32RetCode;
    int32_t i32TimeOutCnt;

    g_FMC_i32ErrCode = FMC_OK;

    if ((u32Addr % FMC_FLASH_PAGE_SIZE) || (u32count % FMC_FLASH_PAGE_SIZE))
    {
        g_FMC_i32ErrCode = FMC_ERR_INVALID_PARAM;
        i32RetCode = FMC_ERR_INVALID_PARAM;
    }
    else
    {
        FMC->ISPCMD  = FMC_ISPCMD_RUN_CKS;
        FMC->ISPADDR = u32Addr;
        FMC->ISPDAT  = u32count;
        FMC->ISPTRG  = FMC_ISPTRG_ISPGO_Msk;

        i32TimeOutCnt = FMC_TIMEOUT_CHKSUM;

        while (FMC->ISPSTS & FMC_ISPSTS_ISPBUSY_Msk)
        {
            if (i32TimeOutCnt-- <= 0)
            {
                g_FMC_i32ErrCode = FMC_ERR_TIMEOUT;
                return FMC_ERR_TIMEOUT;
            }
        }

        FMC->ISPCMD  = FMC_ISPCMD_READ_CKS;
        FMC->ISPADDR = u32Addr;
        FMC->ISPTRG  = FMC_ISPTRG_ISPGO_Msk;

        i32TimeOutCnt = FMC_TIMEOUT_CHKSUM;

