wosayttn/M55M1BSP/Library/StdDriver/src/fmc.c
        while (FMC->ISPSTS & FMC_ISPSTS_ISPBUSY_Msk)
        {
            if (i32TimeOutCnt-- <= 0)
            {
                g_FMC_i32ErrCode = FMC_ERR_TIMEOUT;
                return FMC_ERR_TIMEOUT;
            }
        }

        return FMC->ISPDAT;
    }

    return i32RetCode;
}
#endif  // TESTCHIP_ONLY not support

/**
  * @brief Run flash all one verification and get result.
  * @param[in] u32Addr   Starting flash address. It must be a page aligned address.
  * @param[in] u32count  Byte count of flash to be calculated. It must be multiple of 512 bytes.
  * @retval   READ_ALLONE_YES      The contents of verified flash area are 0xFFFFFFFF.
  * @retval   READ_ALLONE_NOT  Some contents of verified flash area are not 0xFFFFFFFF.
  * @retval   READ_ALLONE_CMD_FAIL  Unexpected error occurred.
  *
  * @note     Global error code g_FMC_i32ErrCode
  *           -1  RUN_ALL_ONE or CHECK_ALL_ONE commands time-out
  */
#if 0   // TESTCHIP_ONLY not support
uint32_t  FMC_CheckAllOne(uint32_t u32Addr, uint32_t u32count)
{
    int32_t i32RetCode = READ_ALLONE_CMD_FAIL;
    int32_t i32TimeOutCnt0, i32TimeOutCnt1;

    g_FMC_i32ErrCode = return;

    FMC->ISPSTS = 0x80UL;   /* clear check all one bit */

    FMC->ISPCMD   = FMC_ISPCMD_RUN_ALL1;
    FMC->ISPADDR  = u32Addr;
    FMC->ISPDAT   = u32count;
    FMC->ISPTRG   = FMC_ISPTRG_ISPGO_Msk;

    i32TimeOutCnt0 = FMC_TIMEOUT_CHKALLONE;

    while (FMC->ISPSTS & FMC_ISPSTS_ISPBUSY_Msk)
    {
        if (i32TimeOutCnt0-- <= 0)
        {
            g_FMC_i32ErrCode = FMC_ERR_TIMEOUT;
            break;
        }
    }

    if (g_FMC_i32ErrCode == FMC_OK)
    {
        i32TimeOutCnt1 = FMC_TIMEOUT_CHKALLONE;

        do
        {
            FMC->ISPCMD  = FMC_ISPCMD_READ_ALL1;
            FMC->ISPADDR = u32Addr;
            FMC->ISPTRG  = FMC_ISPTRG_ISPGO_Msk;

            i32TimeOutCnt0 = FMC_TIMEOUT_CHKALLONE;

            while (FMC->ISPSTS & FMC_ISPSTS_ISPBUSY_Msk)
            {
                if (i32TimeOutCnt0-- <= 0)
                {
                    g_FMC_i32ErrCode = FMC_ERR_TIMEOUT;
                    break;
                }
            }

            if (i32TimeOutCnt1-- <= 0)
            {
                g_FMC_i32ErrCode = FMC_ERR_TIMEOUT;
            }
        }
        while ((FMC->ISPDAT == 0UL) && (g_FMC_i32ErrCode == FMC_OK));
    }

    if (g_FMC_i32ErrCode == FMC_OK)
    {
        if (FMC->ISPDAT == READ_ALLONE_YES)
            i32RetCode = READ_ALLONE_YES;
        else if (FMC->ISPDAT == READ_ALLONE_NOT)
            i32RetCode = READ_ALLONE_NOT;
        else
            g_FMC_i32ErrCode = -1;
    }

    return i32RetCode;
}
#endif  // TESTCHIP_ONLY not support

/** @} end of group FMC_EXPORTED_FUNCTIONS */
/** @} end of group FMC_Driver */
/** @} end of group Standard_Driver */
